[{"created": "2020-12-04", "text": "REST (Representational State Transfer) is a fairly common way of interaction between client applications and services on the Internet. It is a set of restrictions considered when creating applications and web services. This architectural style was developed to help easily build convenient web services. A service written with regard to REST rules is called RESTful.  REST is NOT a protocol or a standard. REST works on top of HTTP and is one of the possible ways to use HTTP. It is not a standard, but rather a set of useful recommendations.", "title": "REST", "link": 4601}, {"created": "2020-12-04", "text": "This optional step is NOT part of the assessment. In this step, you will make your news website a little prettier using CSS. If you followed the requirements for page layouts, you can stylize your site by adding the base.css file to your project.  Create the path static/css in the root of your project and put the base.css file there. Then paste the following code at the top of each page template:  {% load static %} <link rel=\"stylesheet\" href=\"{% static 'css/base.css' %}\"> Tweak your settings a little:  DEBUG = True   STATIC_URL = \"/static/\" STATICFILES_DIRS = [os.path.join(BASE_DIR, \"static\")] Add an URL pattern to match static content:  from django.conf import settings from django.conf.urls.static import static    urlpatterns += static(settings.STATIC_URL) Launch your application again, and check out the result!  You can play around with the style rules in the static/css/base.css file and see what you can get!", "title": "Make your news website a little prettier using CSS", "link": 7306}, {"created": "2020-12-03", "text": "test text", "title": "test title", "link": 8041}, {"created": "2020-02-22", "text": "A new star appeared in the sky.", "title": "A star is born", "link": 9234732}, {"created": "2020-02-10", "text": "Text of the news 2", "title": "News 2", "link": 2}, {"created": "2020-02-09", "text": "Text of the news 3", "title": "News 3", "link": 3}, {"created": "2020-02-09", "text": "Text of the news 1", "title": "News 1", "link": 1}, {"created": "2020-12-05", "text": "dfgdfgdf", "title": "test 1", "link": 1946}, {"created": "2020-12-05", "text": "dfgdfgdf", "title": "test2", "link": 4956}, {"created": "2020-12-08", "text": "ссылка - http://htmlbook.ru/html/textarea", "title": "Тег <textarea>", "link": 2429}]